=СЦЕПИТЬ("🔹<b>Ваш баланс – </b>";СУММ(E2:Z2);" SC🔹

";ЕСЛИ(ЕТЕКСТ(E$1);"🔸 ";""); ЕСЛИ(E$1;E$1;""); ЕСЛИ(E$1;" - ";""); ЕСЛИ(E$1;ЕСЛИ(E2;E2;0);""); ЕСЛИ(E$1;" SC
";"");
ЕСЛИ(ЕТЕКСТ(F$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(F$1);F$1;""); ЕСЛИ(ЕТЕКСТ(F$1);" - ";""); ЕСЛИ(ЕТЕКСТ(E$1);ЕСЛИ(E2;E2;0);""); ЕСЛИ(ЕТЕКСТ(F$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(G$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(G$1);G$1;""); ЕСЛИ(ЕТЕКСТ(G$1);" - ";""); ЕСЛИ(ЕТЕКСТ(G$1);ЕСЛИ(G2;G2;0);""); ЕСЛИ(ЕТЕКСТ(G$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(H$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(H$1);H$1;""); ЕСЛИ(ЕТЕКСТ(H$1);" - ";""); ЕСЛИ(ЕТЕКСТ(H$1);ЕСЛИ(H2;H2;0);""); ЕСЛИ(ЕТЕКСТ(H$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(I$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(I$1);I$1;""); ЕСЛИ(ЕТЕКСТ(I$1);" - ";""); ЕСЛИ(ЕТЕКСТ(I$1);ЕСЛИ(I2;I2;0);""); ЕСЛИ(ЕТЕКСТ(I$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(J$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(J$1);J$1;""); ЕСЛИ(ЕТЕКСТ(J$1);" - ";""); ЕСЛИ(ЕТЕКСТ(J$1);ЕСЛИ(J2;J2;0);""); ЕСЛИ(ЕТЕКСТ(J$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(K$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(K$1);K$1;""); ЕСЛИ(ЕТЕКСТ(K$1);" - ";""); ЕСЛИ(ЕТЕКСТ(K$1);ЕСЛИ(K2;K2;0);""); ЕСЛИ(ЕТЕКСТ(K$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(L$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(L$1);L$1;""); ЕСЛИ(ЕТЕКСТ(L$1);" - ";""); ЕСЛИ(ЕТЕКСТ(L$1);ЕСЛИ(L2;L2;0);""); ЕСЛИ(ЕТЕКСТ(L$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(M$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(M$1);M$1;""); ЕСЛИ(ЕТЕКСТ(M$1);" - ";""); ЕСЛИ(ЕТЕКСТ(M$1);ЕСЛИ(M2;M2;0);""); ЕСЛИ(ЕТЕКСТ(M$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(N$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(N$1);N$1;""); ЕСЛИ(ЕТЕКСТ(N$1);" - ";""); ЕСЛИ(ЕТЕКСТ(N$1);ЕСЛИ(N2;N2;0);""); ЕСЛИ(ЕТЕКСТ(N$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(O$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(O$1);O$1;""); ЕСЛИ(ЕТЕКСТ(O$1);" - ";""); ЕСЛИ(ЕТЕКСТ(O$1);ЕСЛИ(O2;O2;0);""); ЕСЛИ(ЕТЕКСТ(O$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(P$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(P$1);P$1;""); ЕСЛИ(ЕТЕКСТ(P$1);" - ";""); ЕСЛИ(ЕТЕКСТ(P$1);ЕСЛИ(P2;P2;0);""); ЕСЛИ(ЕТЕКСТ(P$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(Q$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(Q$1);Q$1;""); ЕСЛИ(ЕТЕКСТ(Q$1);" - ";""); ЕСЛИ(ЕТЕКСТ(Q$1);ЕСЛИ(Q2;Q2;0);""); ЕСЛИ(ЕТЕКСТ(Q$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(R$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(R$1);R$1;""); ЕСЛИ(ЕТЕКСТ(R$1);" - ";""); ЕСЛИ(ЕТЕКСТ(R$1);ЕСЛИ(R2;R2;0);""); ЕСЛИ(ЕТЕКСТ(R$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(S$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(S$1);S$1;""); ЕСЛИ(ЕТЕКСТ(S$1);" - ";""); ЕСЛИ(ЕТЕКСТ(S$1);ЕСЛИ(S2;S2;0);""); ЕСЛИ(ЕТЕКСТ(S$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(T$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(T$1);T$1;""); ЕСЛИ(ЕТЕКСТ(T$1);" - ";""); ЕСЛИ(ЕТЕКСТ(T$1);ЕСЛИ(T2;T2;0);""); ЕСЛИ(ЕТЕКСТ(T$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(U$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(U$1);U$1;""); ЕСЛИ(ЕТЕКСТ(U$1);" - ";""); ЕСЛИ(ЕТЕКСТ(U$1);ЕСЛИ(U2;U2;0);""); ЕСЛИ(ЕТЕКСТ(U$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(V$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(V$1);V$1;""); ЕСЛИ(ЕТЕКСТ(V$1);" - ";""); ЕСЛИ(ЕТЕКСТ(V$1);ЕСЛИ(V2;V2;0);""); ЕСЛИ(ЕТЕКСТ(V$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(W$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(W$1);W$1;""); ЕСЛИ(ЕТЕКСТ(W$1);" - ";""); ЕСЛИ(ЕТЕКСТ(W$1);ЕСЛИ(W2;W2;0);""); ЕСЛИ(ЕТЕКСТ(W$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(X$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(X$1);X$1;""); ЕСЛИ(ЕТЕКСТ(X$1);" - ";""); ЕСЛИ(ЕТЕКСТ(X$1);ЕСЛИ(X2;X2;0);""); ЕСЛИ(ЕТЕКСТ(X$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(Y$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(Y$1);Y$1;""); ЕСЛИ(ЕТЕКСТ(Y$1);" - ";""); ЕСЛИ(ЕТЕКСТ(Y$1);ЕСЛИ(Y2;Y2;0);""); ЕСЛИ(ЕТЕКСТ(Y$1);" SC
";"");
ЕСЛИ(ЕТЕКСТ(Z$1);"🔸 ";""); ЕСЛИ(ЕТЕКСТ(Z$1);Z$1;""); ЕСЛИ(ЕТЕКСТ(Z$1);" - ";""); ЕСЛИ(ЕТЕКСТ(Z$1);ЕСЛИ(Z2;Z2;0);""); ЕСЛИ(ЕТЕКСТ(Z$1);" SC
";"");ЕСЛИ(СУММ(E2:Z2)>0;"
<i>* таблица заполняется НЕ в режими реального времени, поэтому проверяйте лучше баланс к концу квартала</i>";""))